[{"review": ["Quick service.  ", "Cheap. ", "Pretty good food.  I left full and satisfied. ", "Service is efficient.  Not over-the-top, but not bad, either.   The hostess was a little lost when she was seating me. We walked around the perimeter of the dining room until she settled on a spot for me.  ", "Really beyond that, not much to say about my experience."]},
{"review": ["The staff is amazing and the service is the best I've had in a long time (worthy of a huge tip)."]},
{"review": ["Good margarita specials and the food is pretty decent for a decent price."]},
{"review": ["Service was friendly but when I went to pay I used cash. My bill was like $7.58 and I got out a $10 expecting change. A 20% very decent and well deserved tip would have been about $1.51 but I thought it was very strange that he took it and never came back with my change! Not very much money given away but as a server I always give back correct change and if the customer leaves what I gave them then great! The only reason I didn't stay to say something was because we were in a rush to leave because I was sick to my stomach and we had to rush out of there. (Not because of the food, unfortunately I didn't get to eat too much!). Long story short... Use a card lol."]},
{"review": ["I have many memories here when this building use to be the home of Rock O'la Cafe back in college. Not much has changed interior wise it's a little dated and has the same set-up basically. For cheap Mexican it's pretty much what you expect. ", "The menu is large with plenty of options to choose from.You can't go wrong with the cheese dip and the salsa was decent. Are server was nice but a little out of it. They have some pretty decent drink specials most nights. I ordered a Pacifico but apparently they were out of it so a Dos Equis it was! We waited a while for food when it was pretty dead in there. The server said the ticket got lost but I have a sneaky suspicion he just forgot to put it in. I was in good company so it wasn't that big of a deal and so what if I ate to baskets of chips while I waited:)", "I ordered the chipotle grilled chicken tacos. It was a good size plate with three grilled chicken tacos on corn tortillas smothered with a chipotle sauce. The food was pretty good not the best I've had but decent. I crave Mexican food and if I'm on this side of town I might stop in again, but we just have so many other choices close by that El Cerro just wouldn't be my first choice. ", "For cheap drinks and cheese dip I'm all in!"]},
{"review": ["Everytime I go here I swear not to come back, because it's so awful and then I do and it's the same awful experience. The food is gross, it doesn't even look appetizing, it's usually cold and we always have several different waiters. The only thing that makes it decent is the drink specials aren't bad. It's also overpriced for its lack of quality. If you want a good meal, choose else where."]},
{"review": ["El cerro restaurant great place... Good price I love the food, real Mexican test! High recommend!"]},
{"review": ["This was literally the worst Mexican food I have ever had. I should have not spend $50 on this before giving it a test run, stupid me.", "90% of the food was some how burnt but then cold when we got it. The beef burrito was a joke! Like a JOKE! I would have been better off going to tacco bell for that. My Chorizo was burnt to a crisp. It just goes on and on.", "I just dont understand how you can make chicken and beef with such little flavor. ", "Be warned this place is no good at all. Maybe next time I'll just drink."]},
{"review": ["This is by far my favorite Mexican restaurant. Although the food is above average, it is not the most authentic I have had. However their friendly service and beyond fantastic beer specials are reasons why I frequent this restaurant. It's close to NC State and is a favorite among students."]},
{"review": ["We came around 9:30 pm, restaurant wasn't even a quarter filled so we expected decent service at the least. Server was nice, but service absolutely sucked. Food was incredibly bland, along with the chips and salsa (which is a huge bummer). Queso was also quite liquidy than others I've had. Only decent meal we had at the table that night was the chicken fajitas. Overall, wouldn't come back."]},
{"review": ["I have been here about 3 times for lunch... Today I went here for lunch and got a chicken burrito.. Halfway through I noticed completely RAW CHICKEN!!! I am so disgusted with this place I am never going back! Be aware!"]},
{"review": ["Pretty solid for what it is--a cheap tex mex place near a college campus, hundreds of miles away from Texas and Mexico. Big menu, cheap drinks, good enough food. I grew up in Texas, I did not expect this to be as good as it was."]},
{"review": ["The service is always good, despite the amount of large groups they take in. ", "Great drink specials as far as margaritas and domestic beers go, and excellent service. I am saying that my servers have been great 100% of the time. ", "The food is not outstanding in a unique sense, but consistent and tasty. ", "10/10 would recommend for some good US American audience targeted Mexican food."]},
{"review": ["I really liked this place ,my girlfriend turned me on to it last week. it's located in mission valley and to tell you the truth im kinda kicking myself for not knowing about this place earlier.    ", "this place is just like most Mexican restaurants you would find out here. but i will say they get it right on alot of levels, now mind you i can only speak from my own experience and it just so happens i had a great one here.", "the service here is pretty good,we were seated quickly and drink orders were taken. after a short time the waiter came and took our dinner orders. i got the pollo Monterrey and my date got the caso fundido.  ", "all of which were great, this place is definitely my new favorite go to spot for Mexican.  I'd  recommend this place to anyone who wants some great mexican."]},
{"review": ["After volunteering with the company I work for, our president treated us all out to lunch. The waitress was nice, but you know, not the best server there is. ", "Being a vegetarian, I asked her if the chile relleno that came with my plate can not have any meat, just cheese. She said it was not a problem.", "So when everyone's meal came out, I was disappointed to see meat on my plate. I waited for her to come around, but she was no where in sight. Fortunately, the company prez sat next to me and spotted our waitress and called her over. She apologized briefly for the meat problem and took my plate away to fix it. ", "Well....a couple minutes later, she put the same plate in front of me, literally. ", "The meat was just scraped out of the chile and reheated with some cheese in it. I found out because traces of leftover, scraped meat was still on my plate as well as hiding under some topped off lettuce. The big boss again mentioned the problem for me to our waitress, and this time, she was slightly embarrassed maybe because we found out. Anyways, the third time around, she got it right. But unfortunately, the other 10 people were already done with their meal when I was just starting on mine.", "This place is a no-go. Stay far away."]},
{"review": ["The staff was great. The food was average. I was not a big fan of the enchilada sauce but the burritos were good."]},
{"review": ["Pretty bad. They didn't honor their usual Tuesday drink specials because it was cinco de mayo which sucks but I at least can sort of understand that. But the part that REALLY was ridiculous is that I tried to use a coupon from the \"entertainment book\" coupon book and the manager said he couldn't accept the coupon on a \"busy night like tonight\"... What? That doesn't even make sense. Won't be coming back. Service wasn't good."]},
{"review": ["Worst Mexican food ever! Ordered quesadilla, got a taco covered cheese. Waiter ignored us. No silverware. No napkins. No pico, we ordered it. Fruit flies everywhere. Giant menu. Unfocused menu. Guess it's good for college students gorging after a hangover. Better places to do that."]},
{"review": ["Yuck... waiter was good food not so much.  Won't waste my money the again. Sat outside cause it was really cold in the restaurant.  Outsides was great till people came out to light up a cigarette!  Not a good meal or experience.  May of been better off going to taco bell."]},
{"review": ["I've been here before,  I do enjoy the food. My son and I came for a pre-movie dinner on a busy Friday night.  We had plenty of time to wait for a table, wait for food and eat before the movie started.  The hostess insisted we sit at the bar because like they'd like have a super long wait. Needless to say, our food was up in 15 minutes and now we are too early.  That hostess is not bright. That is all"]}]